Script test/Performance Test/jmeter/scripts/report_002/statistics.json
{
  "01_GET_JobPosition" : {
    "transaction" : "01_GET_JobPosition",
    "sampleCount" : 5642,
    "errorCount" : 42,
    "errorPct" : 0.7444169,
    "meanResTime" : 12009.915809996477,
    "medianResTime" : 10497.0,
    "minResTime" : 20.0,
    "maxResTime" : 40308.0,
    "pct1ResTime" : 24118.4,
    "pct2ResTime" : 24607.85,
    "pct3ResTime" : 27503.0,
    "throughput" : 27.262096891096572,
    "receivedKBytesPerSec" : 37.680427700720934,
    "sentKBytesPerSec" : 3.884468287638799
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 11813,
    "errorCount" : 64,
    "errorPct" : 0.541776,
    "meanResTime" : 6137.903157538293,
    "medianResTime" : 2088.0,
    "minResTime" : 20.0,
    "maxResTime" : 40308.0,
    "pct1ResTime" : 19786.2,
    "pct2ResTime" : 24100.3,
    "pct3ResTime" : 26084.440000000002,
    "throughput" : 57.0803173652116,
    "receivedKBytesPerSec" : 68.69385829701287,
    "sentKBytesPerSec" : 266.93236517837295
  },
  "02_Upload_CV" : {
    "transaction" : "02_Upload_CV",
    "sampleCount" : 615,
    "errorCount" : 8,
    "errorPct" : 1.300813,
    "meanResTime" : 3914.710569105693,
    "medianResTime" : 3630.0,
    "minResTime" : 31.0,
    "maxResTime" : 8462.0,
    "pct1ResTime" : 6295.4,
    "pct2ResTime" : 7050.999999999998,
    "pct3ResTime" : 8132.720000000003,
    "throughput" : 2.991317882244218,
    "receivedKBytesPerSec" : 1.0730621412850507,
    "sentKBytesPerSec" : 251.7791159500474
  },
  "03_Create_Candidate" : {
    "transaction" : "03_Create_Candidate",
    "sampleCount" : 5556,
    "errorCount" : 14,
    "errorPct" : 0.25197983,
    "meanResTime" : 421.0867530597557,
    "medianResTime" : 400.0,
    "minResTime" : 23.0,
    "maxResTime" : 1332.0,
    "pct1ResTime" : 539.3000000000002,
    "pct2ResTime" : 628.1499999999996,
    "pct3ResTime" : 812.0,
    "throughput" : 27.369727780569267,
    "receivedKBytesPerSec" : 30.531026437144703,
    "sentKBytesPerSec" : 13.173957917688845
  }
}