Script test/Performance Test/jmeter/scripts/PT_004_StressTest_HRFilter_HighQuery.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="PT_004_StressTest_HRFilter_HighQuery" enabled="true">
      <stringProp name="TestPlan.comments">Stress Test Truy vấn DB - Trạng thái SUBMITTED</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8081</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup guiclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroupGui" testclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup" testname="Stepping Load (Target 500)" enabled="true">
        <stringProp name="TargetLevel">500</stringProp>
        <stringProp name="RampUp">120</stringProp>
        <stringProp name="Steps">5</stringProp>
        <stringProp name="Hold">60</stringProp>
        <stringProp name="Unit">S</stringProp>
      </com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET_FilterCandidates_Heavy" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/candidate-service/candidates?jobPositionId=62&amp;status=SUBMITTED&amp;page=1&amp;limit=50</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <JSR223Listener guiclass="TestBeanGUI" testclass="JSR223Listener" testname="Auto-Stop (1% Error)" enabled="true">
          <stringProp name="script">
            double threshold = 1.0; 
            long total = Long.parseLong(vars.get("t_req") ?: "0") + 1;
            long err = Long.parseLong(vars.get("t_err") ?: "0") + (sampleResult.isSuccessful() ? 0 : 1);
            vars.put("t_req", total.toString());
            vars.put("t_err", err.toString());
            if (total > 50 &amp;&amp; (err/(double)total)*100 > threshold) {
                log.error("--- TEST STOPPED DUE TO HIGH ERROR RATE: " + (err/(double)total)*100 + "% ---");
                ctx.getEngine().stopTest();
            }
          </stringProp>
        </JSR223Listener>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>