Script test/Performance Test/jmeter/scripts/report_001/statistics.json
{
  "01_GET_JobPosition" : {
    "transaction" : "01_GET_JobPosition",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3513.0145000000043,
    "medianResTime" : 4197.5,
    "minResTime" : 20.0,
    "maxResTime" : 9448.0,
    "pct1ResTime" : 5110.9,
    "pct2ResTime" : 5251.95,
    "pct3ResTime" : 5438.77,
    "throughput" : 33.41520057474145,
    "receivedKBytesPerSec" : 45.870080264356005,
    "sentKBytesPerSec" : 4.796908676256829
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4200,
    "errorCount" : 21,
    "errorPct" : 0.5,
    "meanResTime" : 2137.3578571428575,
    "medianResTime" : 521.5,
    "minResTime" : 20.0,
    "maxResTime" : 13735.0,
    "pct1ResTime" : 5009.9,
    "pct2ResTime" : 5296.95,
    "pct3ResTime" : 8673.889999999998,
    "throughput" : 70.14613778705636,
    "receivedKBytesPerSec" : 83.76606537056368,
    "sentKBytesPerSec" : 305.4394572025052
  },
  "02_Upload_CV" : {
    "transaction" : "02_Upload_CV",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6317.425,
    "medianResTime" : 6011.0,
    "minResTime" : 3030.0,
    "maxResTime" : 13735.0,
    "pct1ResTime" : 9223.5,
    "pct2ResTime" : 10936.8,
    "pct3ResTime" : 12199.78,
    "throughput" : 10.196798205363516,
    "receivedKBytesPerSec" : 3.355782221882329,
    "sentKBytesPerSec" : 869.5814572817885
  },
  "03_Create_Candidate" : {
    "transaction" : "03_Create_Candidate",
    "sampleCount" : 2000,
    "errorCount" : 21,
    "errorPct" : 1.05,
    "meanResTime" : 343.6945000000002,
    "medianResTime" : 338.0,
    "minResTime" : 22.0,
    "maxResTime" : 955.0,
    "pct1ResTime" : 457.0,
    "pct2ResTime" : 502.9499999999998,
    "pct3ResTime" : 629.8600000000001,
    "throughput" : 35.29204164460914,
    "receivedKBytesPerSec" : 38.895552099876475,
    "sentKBytesPerSec" : 16.67738524572084
  }
}